{
  "name": "Amped 2",
  "icon": "https://www.mobygames.com/images/covers/s/26629-amped-2-xbox-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/xbox-game-studios",
        "text": "Microsoft Game Studios"
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/indie-built-inc",
        "text": "Access Software, Inc."
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/xbox/amped-2/release-info",
        "text": "Oct 28, 2003"
      }
    ],
    "Platform",
    [
      {
        "link": "https://www.mobygames.com/browse/games/xbox/",
        "text": "Xbox"
      }
    ],
    "",
    "ESRB Rating",
    [
      {
        "link": "https://www.mobygames.com/attribute/sheet/attributeId,90/",
        "text": "Everyone"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/sports/",
        "text": "Sports"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/birds-eye-view/",
        "text": "Bird's-eye view"
      }
    ],
    "Sport",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/snowboarding-skiing/",
        "text": "Snowboarding / Skiing"
      }
    ]
  ],
  "description": "\nAmped 2 is the sequel to Microsoft's first snowboarding game, Amped: Freestyle Snowboarding.The mountains are larger, there are more goals to accomplish, and there is more diversity to the graphics. Many real snowboarding tricks are including, from Indy's and Mute's to Stalefish's and Tailgrabs. Specific to the sequel are kick flips and shove it's, as well as the ability to link tricks together via \"butter\", similar to Tony Hawk's manual.\n\nThe career mode has you starting out as a level 250 nobody. It's your job to rise the ranks and fight your way to number one in the world. Challenges consist of beating a high score, beating media challenges, performing certain tricks in one run, finding and clearing all the gaps, and knocking down eight snowmen, who taunt you and laugh at you. When you're done with the normal goals, and your player is high enough, you can attempt Sponsor Goals and Photo Shoots, to earn new equipment and further unlock the mountain. Some sponsors may like rails, so you'll have to use just rails to impress them. The photo shoot has you performing tricks to get a set score while going through various rings on a set area of the mountain.\n\nOnce you're finished with single player, you can go online via Xbox Live to play with other people. Your stats will be tracked and you can view your ranking, other player rankings, and where you stand at XSNSports.com. Compete in races, stunt events, or just cruise the mountain.\n",
  "screenshots": [],
  "url": "https://www.mobygames.com/game/amped-2",
  "altTitles": [
    "\"Tenku 2\" -- Japanese title"
  ]
}