{
  "name": "Amped 3",
  "icon": "https://www.mobygames.com/images/covers/s/54366-amped-3-xbox-360-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/2k-sports",
        "text": "2K Sports"
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/indie-built-inc",
        "text": "Indie Built, Inc."
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/xbox360/amped-3/release-info",
        "text": "Nov 15, 2005"
      }
    ],
    "Platform",
    [
      {
        "link": "https://www.mobygames.com/browse/games/xbox360/",
        "text": "Xbox 360"
      }
    ],
    "",
    "ESRB Rating",
    [
      {
        "link": "https://www.mobygames.com/attribute/sheet/attributeId,92/",
        "text": "Teen"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/sports/",
        "text": "Sports"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/behind-view/",
        "text": "Behind view"
      }
    ],
    "Sport",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/snowboarding-skiing/",
        "text": "Snowboarding / Skiing"
      }
    ]
  ],
  "description": "\nAmped 3 is the third installment of the snowboarding franchise. New to the series is that the campaign features a story, in which the protagonist is wrongly accused of stealing the money his crew saved for a trip to Chile. Now he travels to Utah to earn the cash back. The off-the-wall cutscenes use alternating presentation forms, e.g. stop-motion with puppets or drawn sequences.\n\nThe seven levels, based on real resorts, are expansive and include many challenges to tackle, mostly involving stunts. For a steady difficulty curve the harder ones are locked until the easier ones are completed. Additionally there are optional hard quests which improve the abilities of the player character when solved. Besides the snowboard there are alternative forms of movements involved, e.g. a snowmobile. Controls are more action-oriented than in the predecessors.\n\nThe game also features a \"Park Builder\" editor that lets players create their own runs or modify existing ones, it can be even used to change the levels while playing the campaign, and over 300 songs in the customizable soundtrack. Progression and achievements are automatically uploaded to the Xbox LIVE! Leader-boards.\n",
  "screenshots": [],
  "url": "https://www.mobygames.com/game/amped-3",
  "altTitles": []
}