{
  "name": "Asphalt: Nitro",
  "icon": "https://www.mobygames.com/images/covers/s/316768-asphalt-nitro-j2me-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/gameloft-se",
        "text": "Gameloft S.E."
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/gameloft-company-limited",
        "text": "Gameloft Company Limited"
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/j2me/asphalt-nitro_/release-info",
        "text": "May, 2015"
      }
    ],
    "Platform",
    [
      {
        "link": "https://www.mobygames.com/browse/games/j2me/",
        "text": "J2ME"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/racing-driving/",
        "text": "Racing / Driving"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/behind-view/",
        "text": "Behind view"
      }
    ],
    "Gameplay",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/arcade_/",
        "text": "Arcade"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/tricks-stunts/",
        "text": "Tricks / Stunts"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/vehicle-simulator/",
        "text": "Vehicle Simulator"
      }
    ],
    "Vehicular",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/automobile/",
        "text": "Automobile"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/street-racing/",
        "text": "Street Racing"
      }
    ]
  ],
  "description": "\nThe JAVA title Asphalt: Nitro is vastly simplified 2D version of the 3D Android game Asphalt: Nitro. In countries such as China, Japan, Russia and USA players race other cars to reach the finish line first. Next to quick races in the free play mode, there is a career mode divided into seven seasons with multiple events for each one, unlocked gradually. Up to five stars can be earned per event, required to keep unlocking new tracks and seasons.\n\nJust like the main game the focus is on gathering nitro boost to gain extra speed and stay ahead of the other racers. Nitro is earned through a drifting mechanic, taking down other cars, risky driving and perfect runs, and jumps with stunts in the air such as barrel rolls or using obstacles to drive on two wheels. There are also blue and yellow bottles on the track that can be picked up for additional nitro. Nitro fills a horizontal meter near the top of the screen. It can be activated up to three times to access additional power levels, but draining faster. Doing stunts, beating speed limits and taking down cars fills up to six letters of a wanted level. When full, a police car starts to chase the car and it is possible to be busted. Police cars also put vehicles on the road that cause the car to crash upon collision. Tracks have regular traffic as well.\n\nThe cash earned in races can be used to buy or upgrade cars. Cars can be upgraded for acceleration, top speed, handling and nitro, multiple times. It is also possible to choose between different car colours. Compared to the Android version it does not have the many different game modes or multiplayer, the locations are fewer and there is also a smaller collection of cars. The included licensed cars are the Bugatti Veyron 16.4 Grand Sport, Chevrolet Corvette C7, Dodge Challenger SRT8, Ferrari LaFerrari, Ford Shelby GT500, Lamborghini Veneno, McLaren P1, Mitsubishi Lancer Evolution X, Nissan 370Z and RUF CTR 3.\n",
  "screenshots": [
    "https://www.mobygames.com/images/shots/s/814302-asphalt-nitro-j2me-screenshot-busted.jpg",
    "https://www.mobygames.com/images/shots/s/814304-asphalt-nitro-j2me-screenshot-race-won.jpg",
    "https://www.mobygames.com/images/shots/s/814296-asphalt-nitro-j2me-screenshot-car-selection-screen.jpg",
    "https://www.mobygames.com/images/shots/s/814303-asphalt-nitro-j2me-screenshot-drifting-through-a-sandy-section.jpg"
  ],
  "url": "https://www.mobygames.com/game/asphalt-nitro_",
  "altTitles": []
}