{
  "name": "Asphalt: Xtreme",
  "icon": "https://www.mobygames.com/images/covers/s/369602-asphalt-xtreme-ipad-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/gameloft-se",
        "text": "Gameloft S.E."
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/gameloft-iberica-sau",
        "text": "Gameloft Iberica S.A.U."
      },
      {
        "link": "https://www.mobygames.com/company/gameloft-madrid-slu",
        "text": "Gameloft Madrid S.L.U."
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/asphalt-xtreme/release-info",
        "text": "Nov 02, 2016"
      }
    ],
    "Official Site",
    [
      {
        "link": "http://www.asphaltxtreme.com/",
        "text": "Asphalt: Xtreme"
      }
    ],
    "Platforms",
    [
      {
        "link": "https://www.mobygames.com/game/android/asphalt-xtreme",
        "text": "Android"
      },
      {
        "link": "https://www.mobygames.com/game/ipad/asphalt-xtreme",
        "text": "iPad"
      },
      {
        "link": "https://www.mobygames.com/game/iphone/asphalt-xtreme",
        "text": "iPhone"
      },
      {
        "link": "https://www.mobygames.com/game/windows-apps/asphalt-xtreme",
        "text": "Windows Apps"
      },
      {
        "link": "https://www.mobygames.com/game/windows-phone/asphalt-xtreme",
        "text": "Windows Phone"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/racing-driving/",
        "text": "Racing / Driving"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/1st-person/",
        "text": "1st-person"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/behind-view/",
        "text": "Behind view"
      }
    ],
    "Gameplay",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/arcade_/",
        "text": "Arcade"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/tricks-stunts/",
        "text": "Tricks / Stunts"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/vehicle-simulator/",
        "text": "Vehicle Simulator"
      }
    ],
    "Vehicular",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/automobile/",
        "text": "Automobile"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/offroad/",
        "text": "Off-roading"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/racing-track/",
        "text": "Track Racing"
      }
    ]
  ],
  "description": "\nAsphalt: Xtreme is another spin-off in the Asphalt racing series. This time most of the tracks take place in off-road environments instead of streets and there is a wider range of vehicles instead of the traditional sports cars. There are now 35 different licensed vehicles divided over seven categories: Buggy, Monster Truck, Muscle, Pickup, Rally Car, SUV and Truck. The tracks are set in Egypt, Mongolia, Norway, Thailand and the U.S.A. Each track has a different theme such as a desert, ice or an industrial zone with multiple tracks for a single setting. There is also more emphasis on performing stunts, different paths and height differences, drifting and there are many hazards and destructible objects. Cars can also easily wreck each other by ramming.\n\nThe career is the main mode to unlock all vehicles. It consists of five series (Rookie, Amateur, SemiPro, Pro and Master) with several seasons and then further multiple events for each one. Progress is measured in stars that are needed to keep unlocking new events. Stars are earned by completing tracks often with specific vehicles. Race modes, all returning from previous games, are Classic (race for first place), Elimination (the last racer is eliminated with an interval), Infected (catch infections with unlimited boost but with a timer that causes wrecks when it runs out - cars can also infect each other by ramming), Knockdown (wreck opponents) and Versus (race a single opponent). Classic and Infected can be played in the ranked multiplayer mode called World Series, next to the regular multiplayer races for up to eight online players. Other game modes are time limited events (requiring tickets through an energy/stamina system) and mastery challenges.\n\nAs in previous games nitro plays an important role to reach high speeds. It is earned by performing stunts, jumping, drifting, air time, wrecking other vehicles or picking up nitro canisters. Instead a single bar with three taps to reach a perfect nitro as in Asphalt: Nitro, it now consists of up to three bars (four with a paid upgrade). When it is activated the bar is drained and when more than one bar is available the marker will reach a small, red zone when it is almost out. If the player manages to activate the next nitro while the marker is in that zone the nitro is maintained for a longer time as the next bar is accessed. This requires the player to constantly keep an eye on the meter away from the track, but if timed correctly while still performing stunts and maneuvers, a constant nitro can often be maintained for multiple laps without interruption.\n\nCredits are the main currency to buy new vehicles. Most of the time this can also be done through tokens, the premium currency. Each car has statistics such as speed, drift, nitro and a special ability. During races various parts are won to upgrade the statistics acceleration, handling, nitro and top speed. Next to the specific parts currencies are also needed to acquire the upgrades. A vehicle's strength is measured through a rank and a good rank is required to keep up in races. The tokens can also be used to get boosters like double credits, a nitro recharger or an extra tank (four nitro bars). Other in-app purchases are bundles for cars. There are also free and commercial boxes that contain different types of upgrades in categories ranging from common to rare. On top of that there is an oil system that is drained with every race, eventually affecting the vehicles' performance. It can be recharged with the basic currency and a waiting time, which can be skipped with tokens. Cars can also be customized through unlockable skins as visual upgrades.\n",
  "screenshots": [
    "https://www.mobygames.com/images/shots/s/868742-asphalt-xtreme-windows-apps-screenshot-the-multiplayer-lobby.jpg",
    "https://www.mobygames.com/images/shots/s/868718-asphalt-xtreme-windows-apps-screenshot-in-pursuit-with-nitro.jpg",
    "https://www.mobygames.com/images/shots/s/868732-asphalt-xtreme-windows-apps-screenshot-a-quick-explanation.jpg",
    "https://www.mobygames.com/images/shots/s/868738-asphalt-xtreme-windows-apps-screenshot-series-selection.jpg"
  ],
  "url": "https://www.mobygames.com/game/asphalt-xtreme",
  "altTitles": []
}