{
  "name": "Little Britain: The Video Game",
  "icon": "https://www.mobygames.com/images/covers/s/159727-little-britain-the-video-game-psp-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/blast-entertainment-ltd",
        "text": "Blast Entertainment Ltd."
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/gamerholix-ltd",
        "text": "Gamerholix Ltd."
      },
      {
        "link": "https://www.mobygames.com/company/gamesauce",
        "text": "Gamesauce"
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/little-britain-the-video-game/release-info",
        "text": "2007"
      }
    ],
    "Platforms",
    [
      {
        "link": "https://www.mobygames.com/game/ps2/little-britain-the-video-game",
        "text": "PlayStation 2"
      },
      {
        "link": "https://www.mobygames.com/game/psp/little-britain-the-video-game",
        "text": "PSP"
      },
      {
        "link": "https://www.mobygames.com/game/windows/little-britain-the-video-game",
        "text": "Windows"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/action/",
        "text": "Action"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/puzzle/",
        "text": "Puzzle"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/racing-driving/",
        "text": "Racing / Driving"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/sports/",
        "text": "Sports"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/3rd-person/",
        "text": "3rd-person (Other)"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/birds-eye-view/",
        "text": "Bird's-eye view"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/side-view/",
        "text": "Side view"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/top-down/",
        "text": "Top-down"
      }
    ],
    "Gameplay",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/arcade_/",
        "text": "Arcade"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/falling-block-puzzle/",
        "text": "Falling Block Puzzle"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/tile-matching-puzzle/",
        "text": "Tile Matching Puzzle"
      },
      {
        "link": "https://www.mobygames.com/genre/sheet/tricks-stunts/",
        "text": "Tricks / Stunts"
      }
    ],
    "Sport",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/soccer-football-european/",
        "text": "Football (European) / Soccer"
      }
    ],
    "Misc",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/licensed-title/",
        "text": "Licensed"
      }
    ]
  ],
  "description": "\nThis is a collection of mini-games based on the UK comedy sketch TV series Little Britain that ran between 2003 and 2006. The included games are based on some of the scenes and recurring characters. It also includes the original voices of the two leads and the narrator. Players need to unlock the different games by competing in a Tour with three difficulty levels. On Easy, for each 50,000 points another game is opened up and clips from the series are unlocked. The included games are set at different, fictitious locations in Britain and require a lot of button mashing:\nDarkley Noone: Vicky Pollard needs to complete two laps on roller-skates in a skate park. She has to collect CDs to throw a party, while avoiding hazards, performing tricks when jumping in the air, and grinding on rails.\n\n\nHerby: Lou and Andy go to the swimming pool, but as soon as they are there, Andy doesn't like it. While Lou explains to a guard how he wants his handicapped friend to swim, Andy needs to dive off diving boards and perform tricks. There are three boards to choose from and he needs to get back in his wheelchair before time runs out.\n\n\nSessex: Weight Watcher guide Marjorie runs around in a supermarket collecting cookies in a Pac-Man-style mini-game. The ghosts are represented by fatties she needs to avoid, but by picking up cake (similar to the original power pellets), she can take them out for a short time.\n\n\nSlut: Letty has to squash all the frogs in her living room, making sure not to hit any other objects. Gameplay is similar to the Whac-A-Mole concept, except that the frogs jump around instead of popping up.\n\n\nOld Haven: Emily, a real lady, needs to score a number of goals in a game of football (soccer) before time runs out. She needs to progress over the pitch step by step and avoid hitting the defenders as that returns her to the starting location. She does get points for shooting them in their private parts. The PSP version is slightly different as it is presented as a game of penalty kicks, without defenders. The direction and the force of the kick can be determined separately.\n\n\nPox: make matches of three identical items collecting food in Maggie's gullet as she gulps it down. Once it is full, she can spew out all the food over her friends at the party for extra points.\n\n\nLlandewi Breffi: Dafydd Thomas is the only gay in the village and needs to prove it. He rides a bicycle through the streets and needs to collect copies of Gay Magazine while running down other people and slapping fake gays.\nThe PSP version contains an additional game:\nFlatley: help \"Eh Eh Eh\" Anne at the psychiatric institute to destroy the flowers in the garden. She can stamp them, pull them out, and then smash it or chuck it. She needs to avoid the men in white coats that chase after her. She can temporarily stun them by flashing them when she lifts her skirt.\nNext to the games in the Tour, there are also Challenges where a mini-game needs to be replayed with a specific goal, a movie gallery where the unlocked clips can be viewed, and a highscore list. Aside from graphical differences, gameplay is largely identical across the platforms. The PSP version includes wireless multiplayer for up to two players.\n",
  "screenshots": [
    "https://www.mobygames.com/images/shots/s/686220-little-britain-the-video-game-playstation-2-screenshot-here.jpg",
    "https://www.mobygames.com/images/shots/s/379028-little-britain-the-video-game-psp-screenshot-spewing-all-over.jpg",
    "https://www.mobygames.com/images/shots/s/686214-little-britain-the-video-game-playstation-2-screenshot-the.jpg",
    "https://www.mobygames.com/images/shots/s/379015-little-britain-the-video-game-psp-screenshot-title-screen.jpg"
  ],
  "url": "https://www.mobygames.com/game/little-britain-the-video-game",
  "altTitles": [
    "\"Little Britain: The PC Game\" -- In-game Windows title",
    "\"Little Britain: The Computer Game\" -- Windows title",
    "\"Little Britain: Das Videospiel\" -- German title"
  ]
}