{
  "name": "skate 3",
  "icon": "https://www.mobygames.com/images/covers/s/330898-skate-3-playstation-3-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/electronic-arts-inc",
        "text": "Electronic Arts, Inc."
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/black-box-studio",
        "text": "Black Box Studio"
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/skate-3/release-info",
        "text": "2010"
      }
    ],
    "Official Site",
    [
      {
        "link": "http://www.ea.com/ca/skate-3",
        "text": "skate 3"
      }
    ],
    "Platforms",
    [
      {
        "link": "https://www.mobygames.com/game/ps3/skate-3",
        "text": "PlayStation 3"
      },
      {
        "link": "https://www.mobygames.com/game/xbox360/skate-3",
        "text": "Xbox 360"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/sports/",
        "text": "Sports"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/behind-view/",
        "text": "Behind view"
      }
    ],
    "Sport",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/skateboarding/",
        "text": "Skateboarding"
      }
    ]
  ],
  "description": "\nskate 3 takes place in the town of Port Carverton. After a failed trick (jumping over the shark statue at the stadium), \"The Legend\" (which is the player) starts his goal to become a skating mogul. The player works to create a team of skaters that compete against other teams, with a goal to sell a million skateboards.\n\nPlayers can customize the name of the team, and choose a preset logo upon the start of game. Once chosen, the player can change their appearance, clothing and board. Later in game purchases unlock more clothing and board options.\n\nPlayer use the right stick on the controller to do ollies and tricks. Ollies are the basic way to jump, the player pulls back on the stick and flicking it forward to lift off the ground. By controlling the direction of the flick, the player can flip the board. A combination of buttons while in the will modify the trick even further.\n\nThere are various challenges to complete. More notable challenges:\n\"Hall of Meat\", the player will bail from their boards to break and get as many points as possible (by breaking bones, distance, air time, etc.).\n\"Own the Spot/Lot\", both are similar in which the player will complete a trick (or series of tricks) to a predetermined amount of points to own the spot/lot. Difference being Spot is solo and Lot is using the player's team.\n\"Photo\"/\"Film\", the player will have to complete either a predetermined or the player's choice of trick(s) on the object(s). After completing Photo, the player can choose which photo to use for the front cover of the magazine. Film on the other hand doesn't have this choice.\n\nNew features include:\nskate.Create:\nThis tool allows players to create custom content for both private or public use.\nskate.School:\nThis allows players new and old to learn and hone their skateboarding skills.\nskate.Park:\nThis tools allows for the creation of custom maps.\n",
  "screenshots": [],
  "url": "https://www.mobygames.com/game/skate-3",
  "altTitles": []
}