{
  "name": "SSX",
  "icon": "https://www.mobygames.com/images/covers/s/462230-ssx-playstation-3-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/electronic-arts-inc",
        "text": "Electronic Arts, Inc."
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/electronic-arts-vancouver_",
        "text": "Electronic Arts Canada"
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/ssx_/release-info",
        "text": "Feb 28, 2012"
      }
    ],
    "Platforms",
    [
      {
        "link": "https://www.mobygames.com/game/ps3/ssx_",
        "text": "PlayStation 3"
      },
      {
        "link": "https://www.mobygames.com/game/xbox360/ssx_",
        "text": "Xbox 360"
      },
      {
        "link": "https://www.mobygames.com/game/xbox-one/ssx_",
        "text": "Xbox One"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/sports/",
        "text": "Sports"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/behind-view/",
        "text": "Behind view"
      }
    ],
    "Gameplay",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/tricks-stunts/",
        "text": "Tricks / Stunts"
      }
    ],
    "Interface",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/direct_control/",
        "text": "Direct Control"
      }
    ],
    "Sport",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/snowboarding-skiing/",
        "text": "Snowboarding / Skiing"
      }
    ]
  ],
  "description": "\nSSX is a game in the SSX series of snowboarding titles. A few of the characters from past titles as well as some new ones have teamed up to descend the 9 deadliest mountains. Unfortunately, one of the team members decides he wants all the glory for himself and breaks from the group to make a solo attempt.\n\nGameplay is similar to other games in the series. You play as a snowboarder navigating your way down a mountain as you strive for fast times and high trick scores. As you perform tricks you acquire points which build up your \"Tricky\" meter. You can use your Tricky points as boost to increase your speed or you let the meter fill up completely to enter Tricky mode. In Tricky mode, you score more points when performing tricks. In addition to extra points you also have unlimited boost as long as you remain in Tricky Mode.\n\nIn addition to the standard Race and Trick modes, a new challenge type introduced is Survival mode. In general, the objective of survival mode is to reach the bottom of the run without dying or in some tracks finish multiple runs of the track without dying. There are 9 types of survival modes including; trees, rocks, white out, avalanche, low oxygen, darkness, ice, cold and gravity. These 9 survival mode types are fairly similar and rely on either visibility or health to create a challenge.\n\nThe gear is similar to past titles in that more expensive gear offers greater bonuses to stats such as speed, boost or tricks. What makes the gear different from other titles is that some gear more or less necessary for completing Survival mode tracks. Headlamp for Darkness, Goggles for Whiteout, Thermal Pack for Cold, Armor for Avalanche/Trees/Rocks, Oxygen tank for Low Oxygen, Ice Axes for Ice and Wing suit for Gravity.\n\nThe three game modes are World Tour, Explore and Global Events. World Tour is a campaign mode that follows the story of team SSX tackling the 9 deadly descents. Explore is basically a \"free roam\" or \"play now\" mode where the player can go to any run and play provided they unlocked it world tour or spent in game credits to unlock it. Explore is also a place to compete against your friends scores or times. Global Events are live asynchronous online competitions where users post scores and are ranked against everyone else competing on the same track. Instead of directly competing with live players in a head to head race they instead compete against replays of other player runs. When a player completes a run their path and actions are recorded as \"Ghosts\". When a player starts a new run up to 3 Ghosts are loaded into the track with them. The player can then gauge their performance by how well they are doing against those Ghosts.\n",
  "screenshots": [],
  "video": "https://www.youtube.com/embed/T2YXpK7p_RY",
  "url": "https://www.mobygames.com/game/ssx_",
  "altTitles": [
    "\"SSX: Deadly Descents\" -- Working title"
  ]
}