{
  "name": "Tony Hawk's Pro Skater 5",
  "icon": "https://www.mobygames.com/images/covers/s/314148-tony-hawk-s-pro-skater-5-playstation-3-front-cover.jpg",
  "attributes": [
    "Published by",
    [
      {
        "link": "https://www.mobygames.com/company/activision-publishing-inc",
        "text": "Activision Publishing, Inc."
      }
    ],
    "Developed by",
    [
      {
        "link": "https://www.mobygames.com/company/disruptive-games-inc",
        "text": "Disruptive Games Inc."
      },
      {
        "link": "https://www.mobygames.com/company/robomodo-inc",
        "text": "Robomodo, Inc"
      }
    ],
    "Released",
    [
      {
        "link": "https://www.mobygames.com/game/tony-hawks-pro-skater-5/release-info",
        "text": "Sep 29, 2015"
      }
    ],
    "Official Site",
    [
      {
        "link": "http://www.tonyhawkvideogame.com/",
        "text": "Tony Hawk's Pro Skater 5"
      }
    ],
    "Platforms",
    [
      {
        "link": "https://www.mobygames.com/game/ps3/tony-hawks-pro-skater-5",
        "text": "PlayStation 3"
      },
      {
        "link": "https://www.mobygames.com/game/playstation-4/tony-hawks-pro-skater-5",
        "text": "PlayStation 4"
      },
      {
        "link": "https://www.mobygames.com/game/xbox360/tony-hawks-pro-skater-5",
        "text": "Xbox 360"
      },
      {
        "link": "https://www.mobygames.com/game/xbox-one/tony-hawks-pro-skater-5",
        "text": "Xbox One"
      }
    ],
    "Genre",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/sports/",
        "text": "Sports"
      }
    ],
    "Perspective",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/3rd-person/",
        "text": "3rd-person (Other)"
      }
    ],
    "Sport",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/skateboarding/",
        "text": "Skateboarding"
      }
    ],
    "Misc",
    [
      {
        "link": "https://www.mobygames.com/genre/sheet/licensed-title/",
        "text": "Licensed"
      }
    ]
  ],
  "description": "\nTony Hawk's Pro Skater 5 is an entry in the Tony Hawk skateboarding series. Following various spin-offs it is once again a main game after Tony Hawk's Proving Ground in 2007. The game continues the classic gameplay of the original games and lets players create a custom skater or choose one of the ten professional ones: Aaron Homoki, Andrew Reynolds, Chris Cole, David Gonzalez, Ishod Wair, Leticia Bufoni, Lizzie Armanto, Nyjah Huston, Riley Hawk and Tony Hawk. Returning from Tony Hawk's American Wasteland there is a Create-A-Park mode where custom skate parks based on five themes can be created and shared online as new levels.\n\nIn the main career mode eight environments are visited (Asteroid Belt, Bonfire Beach, Mega Park, Mountain, Rooftops, School III, The Berrics and The Bunker) with about 80 missions. Next to regular environments, the Asteroid Belt is an exotic location with a skate park on an asteroid belt in space and a different form of gravity. Levels are not open world, but set in closed locations like the first games in the series. By completing objectives such as locating objects, performing certain tricks or collecting letters, stars are earned to unlock new levels. At least fifteen stars need to be earned in the previous level, as they are not cumulative, to unlock a new level. When all missions in a single stage are completed on the highest, 'Sick' rating for three stars, Pro Challenges are unlocked. The other ratings are 'Am' (one star) and 'Pro' (two stars), awarded based on the performance. Objectives include collecting the five SKATE letters, or the five COMBO letters in one interrupted combo of tricks. Collectibles include VHS tapes, destructible swag crates and DVDs. Next to these main objectives there are secondary ones such as clearing a series of rings in a quick time, keeping the tricks going to prevent the skater's head from exploding, collecting ice-cream, lighting torches with a burning skateboard or pushing beach balls out of a swimming pool.\n\nBy completing levels stat points are earned used to upgrade the skater for various categories multiple times: grind, lip trick, manual, ollie, speed, special, spin and vert. Completing challenges provides new aesthetic options to customize the skaters. Skaters string together tricks and combos with flips, manuals, ollies, grinds, grabs, plants, aerial moves and more. Through successive uninterrupted moves a meter is filled up and when full new special moves become available, replacing the default tricks. Entirely new is the slam technique allowing skaters to dive down immediately in mid-air. Multiplayer, only for PS4 and Xbox One, allows for 20 skaters in a single level, challenging each other. Free skating is always done online. Players then start offline missions, leaving the free skating mode, or join a lobby to challenge the other skaters. In a special mode more unrealistic tricks are available and more visual effects are added to the skater's moves.\n",
  "screenshots": [],
  "video": "https://www.youtube.com/embed/05x2gGngJac",
  "url": "https://www.mobygames.com/game/tony-hawks-pro-skater-5",
  "altTitles": [
    "\"Tony Hawk 5\" -- Working title"
  ]
}