{
  "title": "ExciteBots&#x3a; Trick Racing",
  "platforms": "Wii",
  "mechanics": "n/a",
  "date": "Apr 20, 2009",
  "sports": "",
  "cover": "https://www.mobygames.com/images/covers/s/216862-excitebots-trick-racing-wii-front-cover.jpg",
  "altTitles": [],
  "description": "\nExciteBots is a follow-up to the Wii launch title, Excite Truck. Like Excite Truck, it is in a sense a spiritual continuation of the Excite series started in the early days of the NES with Excite Bike. ExciteBots further mixes up the gameplay in the series, furthering the craziness and intensity brought on with Excite Truck. The latest change features the bikes or trucks from past games replaced by Bots--robotic cars with a few transformations and other elements.\n\nGameplay\nExciteBots plays almost exactly like it's Wii predecessor, meaning the game is played in an arcade-racing style featuring wild jumps, powerslides, turbo boosts, etc. Returning from Excite Truck is the set-up that earning stars through various means (during the races) is typically more important than simply finishing first. Players earn stars from stunts, long-distance jumps, driving through trees, crashing into other bots, and through a wide variety of other means. All of the means to earns stars in Excite Truck remain here, but ExciteBots has added several unusual, strange, and silly means to earn even more, including, but not limited to:\n\n• Hitting a football or soccer ball into a giant goal.\n• Launching a giant dart into a target.\n• Performing tricks on various stunt bars.\n• Attacking with items from item boxes (a la Super Mario Kart).\n• Gliding through butterfly icons.\n• Hitting Question Mark Triggers, which deform the environment.\n• Grinding on rails.\n\nAs is typical of many Nintendo racing and sports games (such as Punch-Out!! or Uniracers), the game is set up in a series of cups of gradually increasing difficulty, each cup featuring four or five races. The game features five cups, each one unlocked gradually as players progress through races and earn enough stars. There are also different difficulty settings.\n\nExciteBots also features a two-player mode (both online and offline), several mini-games, and a feature known as Poker Race, where the goal is to race through cards in order to build winning Poker hands.\n\nThe Bots\nInitially, the game starts with six Bots, but as stars are earned through races, more Bots can be purchased and unlocked. Players may select the color of their Bot before each race, and new colors may also be purchased later on. The Bots are all designed around insects or small animals, such as grasshoppers or beetles, bats or turtles. Bots have the ability to glide during some segments of the game, and an arm extends from the back of each Bot to use items or activate stunt bars. Legs also extend from beneath the Bots, requiring the player to tilt the Wii Remote to make them \"run\" for brief periods of time.\n\nControl\nLike Excite Truck and several Wii racing games, the game is controlled holding the Wii Remote sideways and tilting to steer. The tricks and stunts found in the game utilize a variety of motion controls and quick reflexes, especially where trick bars are concerned. For instance, the Elevator Bar (a vertical bar, like a fireman's pole) swings the player around it in a circle and requires the player to thrust the Wii Remote forward at the right time to launch forward at a high speed. The Red Bar (a horizontal beam near large open or hazardous areas) requires the player to move the Wii Remote forward and back in a circular motion, in increasing speeds to ramp up momentum and launch forward to continue the race.\n",
  "screenshots": [],
  "websites": [
    " [https://www.mobygames.com/game/excitebots-trick-racing](https://www.mobygames.com/game/excitebots-trick-racing)"
  ],
  "filePath": "src/markdown/games/excitebots-trick-racing.md",
  "handle": "excitebots-trick-racing",
  "name": "ExciteBots: Trick Racing",
  "icon": "https://www.mobygames.com/images/covers/s/216862-excitebots-trick-racing-wii-front-cover.jpg",
  "attributes": [
    {
      "name": "Published by",
      "value": "Nintendo of America Inc."
    },
    {
      "name": "Developed by",
      "value": "Monster Games, Inc."
    },
    {
      "name": "Released",
      "value": "Apr 20, 2009"
    },
    {
      "name": "Platforms",
      "value": "Wii,Wii U"
    },
    {
      "name": "Genre",
      "value": "Racing / Driving"
    },
    {
      "name": "Perspective",
      "value": "Behind view"
    },
    {
      "name": "Gameplay",
      "value": "Arcade,Tricks / Stunts,Vehicle Simulator"
    },
    {
      "name": "Vehicular",
      "value": "Automobile,Off-roading,Track Racing"
    }
  ],
  "url": "https://www.mobygames.com/game/excitebots-trick-racing"
}