{
  "title": "NFL Street 2",
  "platforms": "GameCube",
  "mechanics": "n/a",
  "date": "Dec 22, 2004",
  "sports": "",
  "cover": "https://www.mobygames.com/images/covers/s/94167-nfl-street-2-psp-front-cover.jpg",
  "altTitles": [
    "\"NFL Street 2: Unleashed\" -- PSP title"
  ],
  "description": "\nNFL Street 2 is the second game in EA's arcade football series. Players try to become the world's best urban footballer by conquering other teams using several gravity-defying tricks like up-the-wall passes, off-the-wall catches, and highlight-reel wall jukes.\n\nLike the other games in the Street franchise, the game is played with a small amount of players and a focus on arcade gameplay. Unlike the first game, the walls can now be used for run-up passes and receptions, or bonuses by aiming for posters and hotspots.\n\nThere are twelve arenas to compete in (2 unlockable) and the players are licensed from the 2004 NFL rosters. Multiplayer is available on the PS2, PSP and Xbox versions. In singleplayer, there are various game modes such as NFL Challenge where the player has 150 days to build a team to take on a squad of legends. Progress is based on milestones where you sharpen specific skills to reach the top or beat sufficient teams. When five days are left, the team enters a final tournament.\n\nAnother one is the new Own the City mode, where the player create a new character and has to win all street games in the city. New players need to be recruited from pick-up games. The final team to beat consists of rapper Xzibit and a team of NFL stars. Characters created in this mode can be imported into the NFL Challenge, but also in Madden NFL 06.\n\nThe PSP version is a faithful port, with some of the cut scenes removed, and 3 new street modes added for Wi-Fi multiplayer: Street Slalom (an obstacle course), Style Point Challenge, and Style Standoff, a end zone dance contest, similar to Space Channel 5, next to the regular multiplayer modes. Up to four players can play on a single PSP in the Party Play game modes such as the 2 Minute Challenge and Jump Ball Challenge.\n",
  "screenshots": [],
  "websites": [
    " [https://www.mobygames.com/game/nfl-street-2](https://www.mobygames.com/game/nfl-street-2)"
  ],
  "filePath": "src/markdown/games/nfl-street-2.md",
  "handle": "nfl-street-2",
  "name": "NFL Street 2",
  "icon": "https://www.mobygames.com/images/covers/s/94167-nfl-street-2-psp-front-cover.jpg",
  "attributes": [
    {
      "name": "Published by",
      "value": "Electronic Arts, Inc."
    },
    {
      "name": "Developed by",
      "value": "EA Tiburon"
    },
    {
      "name": "Released",
      "value": "Dec 22, 2004"
    },
    {
      "name": "Platforms",
      "value": "GameCube,PlayStation 2,PSP,Xbox"
    },
    {
      "name": "Genre",
      "value": "Sports"
    },
    {
      "name": "Perspective",
      "value": "3rd-person (Other)"
    },
    {
      "name": "Gameplay",
      "value": "Tricks / Stunts"
    },
    {
      "name": "Sport",
      "value": "Football (American)"
    },
    {
      "name": "Misc",
      "value": "Licensed"
    }
  ],
  "video": "https://www.youtube.com/embed/JRCyZSqLxCU",
  "url": "https://www.mobygames.com/game/nfl-street-2"
}